# BoundaryZTranslationFixed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryZTranslationFixed Property
ParameterTypeId Class See Also
---
"Z Translation - Fixed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryZTranslationFixed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryZTranslationFixed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryZTranslationFixed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace